In [38]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [39]:
import numpy as np
import pandas as pd

## DataFrame

    - column 들의 모임 , column 들은 각자 하나의 데이터타입을 가지되, 다른 column 과 다른 데이터타입을 가져도 된다. 
    
    - DataFrame 은 Series 와 별도로 데이터타입을 알려주지않음 , ( d1.dtypes ) 을 통해 개별로 확인 가능  
    
    - data
    - index ( 행이름 ) 
    - column ( 열이름 ) 
    - dtype ( 데이터 타입 )

In [40]:
d1 = pd.DataFrame( data = np.arange(12).reshape(3,4) , index=[1,2,3] ,  columns = list('abcd') , dtype=float)
d1

d1.dtypes # df 데이터타입 별도 확인

     a    b     c     d
1  0.0  1.0   2.0   3.0
2  4.0  5.0   6.0   7.0
3  8.0  9.0  10.0  11.0

a    float64
b    float64
c    float64
d    float64
dtype: object

- 데이터타입을 str,int 로 넣어도  dtype=float 을 지정하면, float 이 가능한 데이터는 float 으로 자동형변환

In [41]:

dat = [[1,2,3,4] , ['a',6,7,8],[9,10,'11',12]] 

d2 = pd.DataFrame( data = dat , index=[1,2,3] ,  columns = list('abcd') , dtype=float)
d2
d2.dtypes

   a     b     c     d
1  1   2.0   3.0   4.0
2  a   6.0   7.0   8.0
3  9  10.0  11.0  12.0

a     object
b    float64
c    float64
d    float64
dtype: object

## column 따로 선택하기

In [42]:
d1['a']
d1
s1=d1['a']

s1.loc[1]
s1.loc[2]

1    0.0
2    4.0
3    8.0
Name: a, dtype: float64

     a    b     c     d
1  0.0  1.0   2.0   3.0
2  4.0  5.0   6.0   7.0
3  8.0  9.0  10.0  11.0

0.0

4.0

## 딕셔너리와 DataFrame

In [43]:
dic1 = {'a':[1,2,3,] , 'b':[2,3,7], 'c':[3,4,10]}

df1 = pd.DataFrame( data=dic1)
df1

   a  b   c
0  1  2   3
1  2  3   4
2  3  7  10

- nested 딕셔너리 활용 예

In [44]:

dic2 = {'a' : {'d':1,'e':2} , 'b':{'d':10,'e':20}, 'c':{'d':100,'e':200}}

df2 = pd.DataFrame(data=dic2)
df2

   a   b    c
d  1  10  100
e  2  20  200

## txt파일 과 DataFrame

    - txt 파일에 한글이 있다면 engine='python' 을 넣어주자

In [64]:
d1=pd.read_table('C:\\Users\\Hyobin An\\workspace-Pandas\\pandas_data1.txt', sep='\t', engine='python' )

d1.head()
d1.tail()

    이름   성별   학년    중간  기말  출석  과제
0   김둘   여자  1.0   NaN  36   5  75
1   김셋   남자  2.0  17.0  20   5  96
2  김여섯   남자  2.0  28.0  20   4  83
3  김일곱   남자  NaN  20.0  44   6  82
4  김여덜  NaN  1.0  20.0  24   8  88

     이름  성별   학년    중간  기말  출석  과제
25  김다섯  남자  2.0  24.0  18   6  84
26  이하나  남자  3.0  29.0  17   5  79
27   이둘  남자  4.0  30.0  42   8  98
28   이셋  남자  4.0  22.0  50   4  79
29   이넷  여자  4.0  24.0  21  10  89

## index_col 

    - 해당 column 을 index 으로 사용

In [69]:
d2 = pd.read_table('C:\\Users\\Hyobin An\\workspace-Pandas\\pandas_data2.txt' , sep='\t' , engine='python' )

d2

d3 = pd.read_table('C:\\Users\\Hyobin An\\workspace-Pandas\\pandas_data2.txt' , sep='\t' , index_col='2', engine='python' )
d3

  num   4   1   3   2   5
0   a  99  98  24   9  73
1   b  36   6  21  79  82
2   c  44  49  39  54  13
3   d  53  94  44  81  35

   num   4   1   3   5
2
9    a  99  98  24  73
79   b  36   6  21  82
54   c  44  49  39  13
81   d  53  94  44  35

## 데이터 가져오는 중에 missing value 가 있다면? 

    - missing value 에 Nan 이 들어간다.

## 실습 1

    - 방법 1,2,4 를 사용하고 
    - index_col 을 지정하지 않는다면 ?

In [79]:
# 첫번째 방법

d1 = pd.DataFrame( data = [['aa','suwon',2],['bb','suwon',1],['cc','aju',3]] , index=['st1','st2','st3'] ,columns=['name','univ','rank'])


d1
d1.dtypes
# 두번째 방법

dat={'name':['aa','bb','cc'],'univ':['suwon','suwon','aju'], 'rank':[2,1,3]}

d2=pd.DataFrame(data=dat, index=['st1','st2','st3'])
d2

d3=pd.read_table('C:\\Users\\Hyobin An\\workspace-Pandas\\prac1.txt' ,index_col=0, sep='\t')
d3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

name    object
univ    object
rank     int64
dtype: object

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3